/************************ (C) COPYRIGHT HARRY007 *******************************
 * 文件名  ：key.h
 * 描述    ：按键驱动底层函数 
 * 库版本  ：V2.1.0
 * 作者    ：HARRY007
 * 修改时间 ：2016-09-12
*******************************************************************************/

#ifndef __KEY_DRIVE_H
#define __KEY_DRIVE_H

/*************宏定义数值*****************/
#define DELAY_CNT       25 //按键消抖值30ms
#define SW0              1 //按键0的对应功能码
#define SW1              2 //按键1的对应功能码
#define NONE             0 //复位功能码状态


/**************管脚宏定义****************/
#define KEY_PORT      GPIOC
#define KEY_PIN_1     GPIO_PIN_5  //按键1
#define KEY_PIN_2     GPIO_PIN_6  //按键2

/***********外部使用变量声明*************/
extern u8 key_funcode;     //按键功能码
extern u8 key_lock;        //按键自锁标志位
extern u8 delay_cout;      //消抖计时变量


/*******************************************************************************
 * 名称: KEY_Init
 * 功能: KEY外设GPIO引脚初始化操作
 * 形参: 无
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void Key_Init(void);

/*******************************************************************************
 * 名称:KEY_Scan 
 * 功能: 按键检测扫描函数
 * 形参: 无
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void Key_Scan(void);

/*******************************************************************************
 * 名称:KEY_Pro
 * 功能: 按键处理函数
 * 形参: 无
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void Key_Pro(void);


#endif


/************************ (C) COPYRIGHT HARRY007 *****END OF FILE**************/