/************************ (C) COPYRIGHT HARRY007 *******************************
 * 文件名  ：time4_drive.h
 * 描述    ：TIME4定时器底层驱动
 * 库版本  ：V2.1.0
 * 作者    ：HARRY007
 * 修改时间 ：2016-09-011
*******************************************************************************/

#ifndef __TIME4_DRIVE_H
#define __TIME4_DRIVE_H

#include "stm8s.h"


/*******************************************************************************
 * 名称: Time4_Init
 * 功能: 定时器4初始化
 * 形参: 无
 * 返回: 无
 * 说明: 定时器4用来一个1ms的时间基准
 ******************************************************************************/
void Time4_Init(void);


#endif


/************************ (C) COPYRIGHT HARRY007 *****END OF FILE**************/