/************************ (C) COPYRIGHT HARRY007 *******************************
 * 文件名  ：eeprom_virtual.h
 * 描述    ：eeprom应用层函数
 * 库版本  ：V2.1.0
 * 作者    ：HARRY007
 * 修改时间 ：2016-09-13
*******************************************************************************/

#ifndef __EEPROM_VIRTUAL_H
#define __EEPROM_VIRTUAL_H

/*******************************************************************************
 * 名称: E2PROM_Init
 * 功能: EEPROM初始化
 * 形参: 无
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void E2PROM_Init(void);

#endif

/************************ (C) COPYRIGHT HARRY007 *****END OF FILE**************/


