/************************ (C) COPYRIGHT HARRY007 *******************************
 * 文件名  ：sysclock.c
 * 描述    ：系统时钟设置   
 * 库版本  ：V2.1.0
 * 作者    ：HARRY007
 *修改时间 ：2016-09-09
*******************************************************************************/

#include "maintask.h"

/*******************************************************************************
 * 名称: Sysclock_Init
 * 功能: 设置系统时钟频率
 * 形参: 无
 * 返回: 无
 * 说明: 
 ******************************************************************************/
void SystemClock_Init(void)
{
    CLK_HSICmd(ENABLE);//启用内部高速时钟
    CLK_HSIPrescalerConfig(CLK_PRESCALER_HSIDIV1);//配置HSI时钟分频系数为1，16MHZ供给CPU  
}

/************************ (C) COPYRIGHT HARRY007 *****END OF FILE**************/